FKDD_COPY_DIFF_3_2026-02-14/Catalogs/БТ_ПользователиССП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>БТ_ПользователиССП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>idSSP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.БТ_НаправлениеДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/БТ_ПользователиССП/Ext/ObjectModule.bsl
Функция ПолучитьMD5_Сервер(Текст)

	ОбъектХеш = Новый ХешированиеДанных(ХешФункция.MD5);
	ОбъектХеш.Добавить(Текст);
	
	Возврат СтрЗаменить(ОбъектХеш.ХешСумма," ","");

КонецФункции

Процедура ВыгрузитьДанные()
	
	ПрофильSQL = Справочники.БТ_ПрофилиSQL.Показатели;
	ADOСоединение = Справочники.БТ_ПрофилиSQL.ПодключитьSQL(ПрофильSQL);
	
	
	
	
	ПарольМД5 = ПолучитьMD5_Сервер(Пароль);
	Если idSSP = 0 Тогда  
		
		ТекстЗапроса = "INSERT INTO [dbo].[users]([login],[pass],[fio],[active])
	 	|VALUES ("+Справочники.БТ_ПрофилиSQL.ПредставлениеСтрокиSQL(Логин)+",
		|"+Справочники.БТ_ПрофилиSQL.ПредставлениеСтрокиSQL(ПарольМД5)+",
		|"+Справочники.БТ_ПрофилиSQL.ПредставлениеСтрокиSQL(Наименование)+",
		|"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(?(ПометкаУдаления,0,1))+")";
		
	Иначе
		
		ТекстЗапроса = "UPDATE [dbo].[users]
   		|SET [login] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеСтрокиSQL(Логин)+",
		|[pass] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеСтрокиSQL(ПарольМД5)+",
		|[fio] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеСтрокиSQL(Наименование)+",
		|[active] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(?(ПометкаУдаления,0,1))+"
		|WHERE [id] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(idSSP);
		
	КонецЕсли;
		
		
	Команда = Новый ComObject("ADODB.Command");
	Команда.CommandText = ТекстЗапроса;
    Команда.ActiveConnection = ADOСоединение; 
	Команда.CommandType = 1;
	попытка
		Команда.Execute();
		
	исключение
		ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		сообщить(ОписаниеОшибки());
		Возврат ;
	КонецПопытки;
	
	Если idSSP = 0 Тогда
		
		RS = Новый COMОбъект("ADODB.Recordset");
		УжеЕстьЗапись = Ложь;
		Попытка
			RS.Open("select id from [ssp].[dbo].[users] where [login] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеСтрокиSQL(Логин), ADOСоединение);
			Пока RS.EOF() = 0 Цикл 			
				
				idSSP 	= стрЗаменить(Rs.Fields.Item("id").Value,Символы.НПП,"");
				rs.MoveNext();
				
			КонецЦикла;
		Исключение
			ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
			сообщить(ОписаниеОшибки());
			Возврат ;	
		КонецПопытки;	

	    Попытка 
			RS.Close();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
		СоотвествиеДепартаментов 	= БТ_РасчетПоказателей.ВыгрузкаДепартаменты(ADOСоединение);
		СоответсвиеОрганизаций 		= БТ_РасчетПоказателей.ВыгрузкаОрганизаций(ADOСоединение);
		СоответсвиеПодразделений 		= БТ_РасчетПоказателей.ВыгрузкаПодразделения(ADOСоединение);
		ТекстЗапроса = "DELETE FROM [dbo].[users_Detail] WHERE [user_id] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(idSSP);
		
		Для каждого ТекСтр Из Организации Цикл
			
			НаправлениеДеятельности = СоотвествиеДепартаментов.Получить(Строка(ТекСтр.НаправлениеДеятельности));
			Подразделение = ?(ПустаяСтрока(ТекСтр.Подразделение), Неопределено, СоответсвиеПодразделений.Получить(Строка(ТекСтр.Подразделение)));
			
			ТекстЗапроса = ТекстЗапроса + "INSERT INTO [dbo].[users_Detail]
			|           ([user_id]
			|           ,[org_id]
			|           ,[dep_id]
			|           ,[sub_id])
			|     VALUES
			|           ("+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(idSSP)+"
			|           ,"+?(ТекСтр.Организация.Пустая(), "0", Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(СоответсвиеОрганизаций.Получить(ТекСтр.Организация.наименование)))+"
			|           ,"+?(НаправлениеДеятельности = Неопределено, "0", Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(НаправлениеДеятельности))+"
			|           ,"+?(Подразделение = Неопределено, "0", Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Подразделение))+")";

			
		КонецЦикла;
		
				
		
	Команда = Новый ComObject("ADODB.Command");
	Команда.CommandText = ТекстЗапроса;
    Команда.ActiveConnection = ADOСоединение; 
	Команда.CommandType = 1;
	попытка
		Команда.Execute();
		
	исключение
		ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		сообщить(ОписаниеОшибки());
		Возврат ;
	КонецПопытки;

	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
КонецПроцедуры

Процедура УдалитьДанные()
	
	ПрофильSQL = Справочники.БТ_ПрофилиSQL.Показатели;
	ADOСоединение = Справочники.БТ_ПрофилиSQL.ПодключитьSQL(ПрофильSQL);
	
	Если idSSP = 0 Тогда  
		
		Возврат;
		
	Иначе
		
		ТекстЗапроса = "DELETE FROM [dbo].[users]
		|WHERE [id] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(idSSP);
		
	КонецЕсли;
		
		
	Команда = Новый ComObject("ADODB.Command");
	Команда.CommandText = ТекстЗапроса;
    Команда.ActiveConnection = ADOСоединение; 
	Команда.CommandType = 1;
	попытка
		Команда.Execute();
		
	исключение
		ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		сообщить(ОписаниеОшибки());
		Возврат ;
	КонецПопытки;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	УдалитьДанные();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() ТОгда
		
		idssp = 0;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_ПользователиССП.Логин КАК Логин
		|ИЗ
		|	Справочник.БТ_ПользователиССП КАК БТ_ПользователиССП
		|ГДЕ
		|	БТ_ПользователиССП.Логин = &Логин
		|	И БТ_ПользователиССП.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Логин", Логин);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		
		Сообщить(СтрШаблон("Указанный логин '%1' занят у другово пользователя",Логин));
		Отказ = истина;
		
	КонецЕсли;
		
	Если не Отказ Тогда
		
		ВыгрузитьДанные();
		
	КонецЕсли;
	
КонецПроцедуры
